    questions = {
        'Минуле': [
            ['Перша позиція: Чи прагнете ви до вивчення минулого, щоб зрозуміти причинно-наслідкові зв’язки?'],
            ['Друга позиція: Чи готові ви допомогти людям, засновуючись на власному досвіді?'],
            ['Третя позиція: Чи відчуваєте ви вину за минулі помилки або проблеми?'],
            ['Четверта позиція: Чи здатні ви делегувати завдання, пов’язані з досвідом минулого?']
        ],
        'Майбутнє': [
            ['Перша позиція: Чи зосереджені ви на прогнозуванні майбутніх подій та можливих наслідків?'],
            ['Друга позиція: Чи готові ви ділитися своїми прогнозами з іншими, щоб покращити ситуацію?'],
            ['Третя позиція: Чи намагаєтеся ви контролювати майбутні події та ситуації?'],
            ['Четверта позиція: Чи здатні ви делегувати завдання, пов’язані з плануванням майбутнього?']
        ],
        'Вічність': [
            ['Перша позиція: Чи цікавлять вас вічні питання, такі як походження Всесвіту або сенс життя?'],
            ['Друга позиція: Чи готові ви допомогти людям зрозуміти різні ідеології, філософії та релігії, враховуючи їхнє раціональне зерно?'],
            ['Третя позиція: Чи ставите ви себе в центр уваги та відчуваєте стид через це?'],
            ['Четверта позиція: Чи здатні ви делегуватвати завдання, пов\'язані з вічними питаннями?'],
        ],
        'Теперішнє': [
            ['Перша позиція: Чи зосереджені ви на теперішньому моменті, відчуваючи присутність тут і зараз?'],
            ['Друга позиція: Чи готові ви допомогти людям зосередитись на теперішньому, щоб знайти гармонію?'],
            ['Третя позиція: Чи відчуваєте ви гордість за свої поточні досягнення та можливості?'],
            ['Четверта позиція: Чи здатні ви делегувати завдання, пов\'язані з теперішнім моментом?']
        ],
    }
